src/InformationRegisters/ДатыРасписаний/ДатыРасписаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДатыРасписаний</name>
  <resources>
    <name>АктуальнаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВалютаДохода</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ВалютаРасхода</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Выполнено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПлановаяОперация</name>
    <type>
      <types>DocumentRef.ОбменВалюты</types>
      <types>DocumentRef.Доход</types>
      <types>DocumentRef.МыВзялиВДолг</types>
      <types>DocumentRef.МыВернулиДолг</types>
      <types>DocumentRef.НамВернулиДолг</types>
      <types>DocumentRef.МыДалиВДолг</types>
      <types>DocumentRef.Перемещение</types>
      <types>DocumentRef.Расход</types>
      <types>DocumentRef.УниверсальнаяОперация</types>
    </type>
  </resources>
  <resources>
    <name>Пропустить</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СуммаДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДохода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКомиссии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПроцентов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВладелецРасписания</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПлановаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Расписания/Расписания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Расписания</name>
  <resources>
    <name>ВалютаДохода</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ВалютаРасхода</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаРасписания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияРасписания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПовторов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НеИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОписаниеРасписания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.СпособыПовторовСобытий</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокДнейНедели</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПорядокПериодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДохода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКомиссии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПроцентов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ШаблонДнейНедели</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ШаблонНомеровМесяцев</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ШаблонЧиселМесяца</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВладелецРасписания</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ДатыРасписаний/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодготовитьФормуНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если ЗначениеЗаполнено(ТекущийОбъект.ПлановаяОперация) Тогда
		ТекущийОбъект.Пропустить     = ТекущийОбъект.ПлановаяОперация.ПометкаУдаления;
		ТекущийОбъект.АктуальнаяДата = ТекущийОбъект.ПлановаяОперация.Дата;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПлановыеОперации.СформироватьОборотыШаблонаДокументов(ТекущийОбъект.ВладелецРасписания);
	Если НЕ ЗначениеЗаполнено(Запись.ПлановаяОперация) Тогда
		ИзменитьОграниченияТипаПлановойОперации();
		Модифицированность = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.ПлановаяОперация) Тогда
		ТекущийОбъект.ПлановаяОперация = Неопределено;
	КонецЕсли; 
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПлановаяОперацияПриИзменении(Элемент)
	
	ПлановаяОперацияПриИзмененииСервер();
	
КонецПроцедуры
 
&НаКлиенте
Процедура ПлановаяОперацияОчистка(Элемент, СтандартнаяОбработка)
	
	ИзменитьДоступностьРеквизитов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПлановаяОперацияОткрытие(Элемент, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Запись.ПлановаяОперация) Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры



#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицыФормы



#КонецОбласти


#Область ОбработчикиКомандФормы



#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()

	ТипШаблона = ТипЗнч(Запись.ВладелецРасписания);
	Элементы.ГруппаСуммыПогашенияДолга.Видимость = ТипШаблона = Тип("ДокументСсылка.МыВернулиДолг")
		ИЛИ ТипШаблона = Тип("ДокументСсылка.НамВернулиДолг");
		
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Новый ПараметрВыбора("ЭтоШаблон", Ложь));
	МассивПараметров.Добавить(Новый ПараметрВыбора("Тип", ТипЗнч(Запись.ВладелецРасписания)));
	Элементы.ПлановаяОперация.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
	Если НЕ ЗначениеЗаполнено(Запись.ПлановаяОперация) Тогда
		ИзменитьОграниченияТипаПлановойОперации();
	КонецЕсли; 

	Если ЗначениеЗаполнено(Запись.ВладелецРасписания) Тогда
		
		Расписание = РегистрыСведений.Расписания.СоздатьМенеджерЗаписи();
		Расписание.ВладелецРасписания = Запись.ВладелецРасписания;
		Расписание.Прочитать();
		ЗаполнитьЗначенияСвойств(ПараметрыРасписания, Расписание);
		
	КонецЕсли;
	
	ИзменитьДоступностьРеквизитов(ЭтаФорма);
	
КонецПроцедуры

Процедура ИзменитьОграниченияТипаПлановойОперации()

	МассивТипов = Новый Массив;
	МассивТипов.Добавить(ТипЗнч(Запись.ВладелецРасписания));
	ТипВладельца = Новый ОписаниеТипов(МассивТипов);
	Запись.ПлановаяОперация = ТипВладельца.ПривестиЗначение(Запись.ПлановаяОперация);

КонецПроцедуры
 
&НаСервере
Процедура ПлановаяОперацияПриИзмененииСервер()

	Если ЗначениеЗаполнено(Запись.ПлановаяОперация) Тогда
		Запись.Пропустить     = Запись.ПлановаяОперация.ПометкаУдаления;
		Запись.Выполнено      = Запись.ПлановаяОперация.Проведен;
		Запись.АктуальнаяДата = Запись.ПлановаяОперация.Дата;
	Иначе
		Запись.Выполнено      = Ложь;
	КонецЕсли; 
	ПлановыеОперации.ОбновитьСуммыПлановойОперации(Запись, Запись.ПлановаяОперация, ПараметрыРасписания);
	ИзменитьДоступностьРеквизитов(ЭтаФорма);

КонецПроцедуры
 
&НаКлиентеНаСервереБезКонтекста 
Процедура ИзменитьДоступностьРеквизитов(Форма)

	Элементы = Форма.Элементы;
	Элементы.Пропустить.Доступность = НЕ ЗначениеЗаполнено(Форма.Запись.ПлановаяОперация);
	Элементы.АктуальнаяДата.Доступность = Элементы.Пропустить.Доступность;

КонецПроцедуры

#КонецОбласти
